app/Controllers/Main.php

SELECT *
FROM `ob_okres`
WHERE `kraj` = 141
---
    public function __construct(){
        $this->okres= new Okres();
        $this->obec= new Obec();
        $okresy = $this->okres->where("kraj", 141)->findall();

SELECT COUNT(*) AS `numrows`
FROM (
SELECT `ob_obec`.`nazev`, count(*) as pocet
FROM `ob_obec`
INNER JOIN `ob_cast_obce` ON `ob_obec`.`kod` = `ob_cast_obce`.`obec`
INNER JOIN `ob_ulice` ON `ob_ulice`.`cast_obce` = `ob_cast_obce`.`kod`
INNER JOIN `ob_adresni_misto` ON `ob_adresni_misto`.`ulice` = `ob_ulice`.`kod`
WHERE `okres` = '3708'
GROUP BY `ob_obec`.`kod`
) CI_count_all_results
SELECT `ob_obec`.`nazev`, count(*) as pocet
FROM `ob_obec`
INNER JOIN `ob_cast_obce` ON `ob_obec`.`kod` = `ob_cast_obce`.`obec`
INNER JOIN `ob_ulice` ON `ob_ulice`.`cast_obce` = `ob_cast_obce`.`kod`
INNER JOIN `ob_adresni_misto` ON `ob_adresni_misto`.`ulice` = `ob_ulice`.`kod`
WHERE `okres` = '3708'
GROUP BY `ob_obec`.`kod`
ORDER BY `pocet` DESC
 LIMIT 20, 20
---
    public function getOkres($id)
    {
        $perPage = $this->request->getVar("per_page") ?? 20;
        $this->data["obec"] = $this->obec
        ->select("obec.nazev, count(*) as pocet")
        ->where("okres", $id)->join('cast_obce', 'obec.kod = cast_obce.obec',"inner")
        ->join('ulice', 'ulice.cast_obce = cast_obce.kod',"inner")
        ->join('adresni_misto', 'adresni_misto.ulice = ulice.kod',"inner")
        ->groupBy("obec.kod")
        ->orderBy("pocet", "desc")
        ->paginate(20);